//字库定义 1-成长			
var str1 = [
	"总有一次哭泣，让人瞬间长大。",
	"在你想要放弃的那一刻，想想为什么当初坚持走到了这里。",
	"不要着急，最好的总会在最不经意的时候出现。--泰戈尔",
	"一个人的时候，怎么过?就算再难以承受，其实到最后我们总能走得过来。--《魔女宅急便》",
	"阴天，晴天，雨天，你最喜欢那种天气?--《岁月的童话》",
	"成长是一笔交易，我们都是用朴素的童真与未经人事的洁白去交换长大的勇气、成熟的情感、广阔的视野……或其他认为值得的东西。--《魔女宅急便》",
	"我们最终都要远行，最终都要跟稚嫩的自己告别。--海子",
	"Tomorrow is another day--Gone with the wind"
];
//2-梦想
var str2 = [
	"你的心到哪儿\n你的宝藏就在哪儿\n--《牧羊少年奇幻之旅》",
	"只有一样东西令梦想无法成真\n那就是担心失败\n--《牧羊少年奇幻之旅》",
	"恰恰是实现梦想的可能性\n才使生活变得有趣--《牧羊少年奇幻之旅》",
	"一个人至少拥有一个梦想，有一个理由去坚强。心若没有栖息的地方，到哪里都是在流浪。--三毛",
	"我不知将去何方\n但我已在路上--《千与千寻》",
	"梦想不会逃跑\n会逃跑的永远都是自己\n--《牧羊少年奇幻之旅》",
	"我不去想是否能够成功\n既然选择了远方\n便只顾风雨兼程--汪国真"
];
//3-考前
var str3 = [
	"当你真心渴望追求某种事物的话，整个宇宙都会联合起来帮你完成。\n--《牧羊少年奇幻之旅》",
	"May the Force be with you.--Star Wars",
	"To make each day count.--Titanic",
	"Miracles happen every day.--Forrest Gump",
	"If Not Me，Who！\nIf Not Now，When！",
	"既然选择了远方\n便只顾风雨兼程--汪国真"
];
//4-毕业
var str4 = [
	"以后，你会怎样想起我的名字",
	"多想错过毕业的末班车去遇见最深爱的你",
	"以后再也不用担心点名、交作业、考试、挂科了。。。",
	"以后的晚上没有你们的四重奏我不知还能否安然入睡",
	"以后我搭讪的词典里就少了老师今天布置作业了吗",
	"以后你把我从床上骗起来的手段就少了老师点名了",
	"以后再也不用挤食堂、早起占座、吐槽学校了",
	"以后，现在就成了以前"
];
//5-亲情
var str5 = [
	"人活在世界上，重要的是爱人的能力，而不是被爱。我们不懂得爱人又如何能被人所爱。--三毛",
	"成长，是每个孩子的权力，也是他们必经的征程，或平坦、或崎岖，有悲欢，有离合…--《悬崖上的金鱼公主》",
	"学会长大，学会承受，学会哭过之后，还可以微笑地拥抱爸爸妈妈。--《魔女宅急便》",
	"父母不是赖以依靠的人，而是使依靠成为不必要的人。",
	"一路有你"
];
//6-爱情
var str6 = [
	"谢谢让我遇见你",
	"我爱你是因为整个宇宙都合力助我来到你的身边。\n--《牧羊少年奇幻之旅》",
	"沙丘会随风改变形状，但沙漠永远存在。我们的爱情也如此。\n--《牧羊少年奇幻之旅》",
	"每想你一次，天上飘落一粒沙，从此形成了撒哈拉。每想你一次，天上就掉下一滴水，于是形成了太平洋。--三毛",
	"Whatever comes, I'II love you, just as I do now. Until I die.--Gone with the wind",
	"真正的美丽，不是青春的容颜，而是绽放的心灵。",
	"爱不是一句话，只是一个动作。——《千与千寻》",
	"因为爱你，只要你一个肯定，我就足够勇敢。——《哈尔的移动城堡》",
	"幸福就是猫吃鱼，狗吃肉，奥特曼打小怪兽。"
];

//7-不忘初心
var str7 = [
	"岁月永远年轻，我们慢慢老去，你会发现，童心未泯，是一件值得骄傲的事情。--宫崎骏",
	"相信我，我们可以更快乐，因为童真只是一种态度。",
	"生命可以随心所欲，但不能随波逐流。——《猫的报恩》",
	"回忆是一种很奇妙的东西，它生活在过去，存在于现在，却能影响未来。——《岁月的童话》"
];

//8-工作
var str8 = [
	"心很脆弱，你得学会去哄他，不管遇到多大困难，告诉你的心“All is well”--《三个白痴》",
	"Life was like a box of chocolates, you never know what you're gonna get.--Forrest Gump",
	"怕什么路途遥远。走一步有一步的风景，进一步有一步的欢喜。幸福，在路上。--《龙猫》",
	"我不太肯定我的方向\n但是我希望自己能走的远一点--《魔女急宅便》",
	"既然目标是地平线\n留给世界的只能是背影--汪国真",
	"我不去想是否能够成功\n既然选择了远方\n便只顾风雨兼程--汪国真"
];

/**
 * 随机获取字库中的一个字符串
 * @param {Object} strs
 */
function getRandomStr(strs){
	var len = strs.length;
	var index = Math.floor( Math.random()*len );
	//alert(index+":"+str1[index]);
	return strs[index];
};


function getRandomStr2(s1,s2){
	//var str = s1.concat(s2);
	alert( getRandomStr( s1.concat(s2) ) );
};
